[
  {
    "company": "Capital One",
    "title": "Manager, Product Management",
    "location": {
      "city": "New York",
      "state": "New York"
    },
    "duration": {
      "start": "2025-02",
      "end": "Present"
    },
    "description": "Leading product initiatives across marketing and data platforms. Unified engagement data across business lines, launched a $3MM NPV paperless campaign, and improved platform resiliency by reactivating over 1MM valid emails while optimizing AWS and Databricks infrastructure."
  },
  {
    "company": "Haven Technologies",
    "title": "Senior Product Manager",
    "location": {
      "city": "New York",
      "state": "New York"
    },
    "duration": {
      "start": "2023-09",
      "end": "2024-12"
    },
    "description": "Managed a team of six and led the implementation of a serverless AWS architecture. Drove product strategy for an AI-enabled underwriting tool, partnered with sales and marketing to accelerate deal closures, and delivered $8M in AWS cost savings through data analysis and platform consolidation."
  },
  {
    "company": "Haven Technologies",
    "title": "Product Manager",
    "location": {
      "city": "New York",
      "state": "New York"
    },
    "duration": {
      "start": "2021-07",
      "end": "2023-09"
    },
    "description": "Defined product vision and roadmap for a new B2B SaaS platform, launching it to $250K+ in first-year revenue. Shipped major features for MassMutual’s new business platform, including a new submission flow with 30% adoption in the first week. Led feasibility analysis, vendor partnerships, and executive-level communication."
  },
  {
    "company": "Haven Technologies",
    "title": "Software Engineer",
    "location": {
      "city": "New York",
      "state": "New York"
    },
    "duration": {
      "start": "2020-07",
      "end": "2021-07"
    },
    "description": "Built and shipped features for MassMutual’s insurance platform using Angular and Node. Advocated for and contributed to a shared front-end design system to improve consistency and developer velocity."
  },
  {
    "company": "American Express",
    "title": "Software Engineer",
    "location": {
      "city": "New York",
      "state": "New York"
    },
    "duration": {
      "start": "2017-08",
      "end": "2020-07"
    },
    "description": "Developed high-volume, multi-million dollar loan applications using React and Node. Led architecture discussions, created reusable components for the design system, and collaborated closely with product and design teams in an Agile environment."
  }
]
